Revit 2027 API
ConduitSize.NominalDiameter Property
 Nominal diameter
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NominalDiameter { get; }
Public ReadOnly Property NominalDiameter As Double
	Get
public:
property double NominalDiameter {
	double get ();
}
member NominalDiameter : float with get
Property Value
Double
See Also
Reference
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace